MikroElektronika/core_packages/PIC/XC8/def/PIC18F47J13/mcu.h
// Register: RPINR9
#define RPINR9 RPINR9
extern volatile unsigned char           RPINR9              __at(0xEEA);
#ifndef _LIB_BUILD
asm("RPINR9 equ 0EEAh");
#endif

// Register: RPINR12
#define RPINR12 RPINR12
extern volatile unsigned char           RPINR12             __at(0xEF2);
#ifndef _LIB_BUILD
asm("RPINR12 equ 0EF2h");
#endif

// Register: RPINR13
#define RPINR13 RPINR13
extern volatile unsigned char           RPINR13             __at(0xEF3);
#ifndef _LIB_BUILD
asm("RPINR13 equ 0EF3h");
#endif

// Register: RPINR14
#define RPINR14 RPINR14
extern volatile unsigned char           RPINR14             __at(0xEF4);
#ifndef _LIB_BUILD
asm("RPINR14 equ 0EF4h");
#endif

// Register: RPINR16
#define RPINR16 RPINR16
extern volatile unsigned char           RPINR16             __at(0xEF7);
#ifndef _LIB_BUILD
asm("RPINR16 equ 0EF7h");
#endif

// Register: RPINR17
#define RPINR17 RPINR17
extern volatile unsigned char           RPINR17             __at(0xEF8);
#ifndef _LIB_BUILD
asm("RPINR17 equ 0EF8h");
#endif

// Register: RPINR21
#define RPINR21 RPINR21
extern volatile unsigned char           RPINR21             __at(0xEFC);
#ifndef _LIB_BUILD
asm("RPINR21 equ 0EFCh");
#endif

// Register: RPINR22
#define RPINR22 RPINR22
extern volatile unsigned char           RPINR22             __at(0xEFD);
#ifndef _LIB_BUILD
asm("RPINR22 equ 0EFDh");
#endif

// Register: RPINR23
#define RPINR23 RPINR23
extern volatile unsigned char           RPINR23             __at(0xEFE);
#ifndef _LIB_BUILD
asm("RPINR23 equ 0EFEh");
#endif

// Register: RPINR24
#define RPINR24 RPINR24
extern volatile unsigned char           RPINR24             __at(0xEFF);
#ifndef _LIB_BUILD
asm("RPINR24 equ 0EFFh");
#endif

// Register: CCP10CON
#define CCP10CON CCP10CON
extern volatile unsigned char           CCP10CON            __at(0xF00);
#ifndef _LIB_BUILD
asm("CCP10CON equ 0F00h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP10M                 :4;
        unsigned DC10B                  :2;
    };
    struct {
        unsigned CCP10M0                :1;
        unsigned CCP10M1                :1;
        unsigned CCP10M2                :1;
        unsigned CCP10M3                :1;
        unsigned DC10B0                 :1;
        unsigned DC10B1                 :1;
    };
} CCP10CONbits_t;
extern volatile CCP10CONbits_t CCP10CONbits __at(0xF00);
// bitfield macros
#define _CCP10CON_CCP10M_POSN                               0x0
#define _CCP10CON_CCP10M_POSITION                           0x0
#define _CCP10CON_CCP10M_SIZE                               0x4
#define _CCP10CON_CCP10M_LENGTH                             0x4
#define _CCP10CON_CCP10M_MASK                               0xF
#define _CCP10CON_DC10B_POSN                                0x4
#define _CCP10CON_DC10B_POSITION                            0x4
#define _CCP10CON_DC10B_SIZE                                0x2
#define _CCP10CON_DC10B_LENGTH                              0x2
#define _CCP10CON_DC10B_MASK                                0x30
#define _CCP10CON_CCP10M0_POSN                              0x0
#define _CCP10CON_CCP10M0_POSITION                          0x0
#define _CCP10CON_CCP10M0_SIZE                              0x1
#define _CCP10CON_CCP10M0_LENGTH                            0x1
#define _CCP10CON_CCP10M0_MASK                              0x1
#define _CCP10CON_CCP10M1_POSN                              0x1
#define _CCP10CON_CCP10M1_POSITION                          0x1
#define _CCP10CON_CCP10M1_SIZE                              0x1
#define _CCP10CON_CCP10M1_LENGTH                            0x1
#define _CCP10CON_CCP10M1_MASK                              0x2
#define _CCP10CON_CCP10M2_POSN                              0x2
#define _CCP10CON_CCP10M2_POSITION                          0x2
#define _CCP10CON_CCP10M2_SIZE                              0x1
#define _CCP10CON_CCP10M2_LENGTH                            0x1
#define _CCP10CON_CCP10M2_MASK                              0x4
#define _CCP10CON_CCP10M3_POSN                              0x3
#define _CCP10CON_CCP10M3_POSITION                          0x3
#define _CCP10CON_CCP10M3_SIZE                              0x1
#define _CCP10CON_CCP10M3_LENGTH                            0x1
#define _CCP10CON_CCP10M3_MASK                              0x8
#define _CCP10CON_DC10B0_POSN                               0x4
#define _CCP10CON_DC10B0_POSITION                           0x4
#define _CCP10CON_DC10B0_SIZE                               0x1
#define _CCP10CON_DC10B0_LENGTH                             0x1
#define _CCP10CON_DC10B0_MASK                               0x10
#define _CCP10CON_DC10B1_POSN                               0x5
#define _CCP10CON_DC10B1_POSITION                           0x5
#define _CCP10CON_DC10B1_SIZE                               0x1
#define _CCP10CON_DC10B1_LENGTH                             0x1
#define _CCP10CON_DC10B1_MASK                               0x20

// Register: CCPR10L
#define CCPR10L CCPR10L
extern volatile unsigned char           CCPR10L             __at(0xF01);
#ifndef _LIB_BUILD
asm("CCPR10L equ 0F01h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR10L                :8;
    };
} CCPR10Lbits_t;
extern volatile CCPR10Lbits_t CCPR10Lbits __at(0xF01);
// bitfield macros
#define _CCPR10L_CCPR10L_POSN                               0x0
#define _CCPR10L_CCPR10L_POSITION                           0x0
#define _CCPR10L_CCPR10L_SIZE                               0x8
#define _CCPR10L_CCPR10L_LENGTH                             0x8
#define _CCPR10L_CCPR10L_MASK                               0xFF

// Register: CCPR10H
#define CCPR10H CCPR10H
extern volatile unsigned char           CCPR10H             __at(0xF02);
#ifndef _LIB_BUILD
asm("CCPR10H equ 0F02h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR10H                :8;
    };
} CCPR10Hbits_t;
extern volatile CCPR10Hbits_t CCPR10Hbits __at(0xF02);
// bitfield macros
#define _CCPR10H_CCPR10H_POSN                               0x0
#define _CCPR10H_CCPR10H_POSITION                           0x0
#define _CCPR10H_CCPR10H_SIZE                               0x8
#define _CCPR10H_CCPR10H_LENGTH                             0x8
#define _CCPR10H_CCPR10H_MASK                               0xFF

