MikroElektronika/core_packages/PIC/XC8/def/PIC18F47J13/mcu.h
extern volatile T3GCONbits_t T3GCONbits __at(0xF97);
// bitfield macros
#define _T3GCON_T3GSS0_POSN                                 0x0
#define _T3GCON_T3GSS0_POSITION                             0x0
#define _T3GCON_T3GSS0_SIZE                                 0x1
#define _T3GCON_T3GSS0_LENGTH                               0x1
#define _T3GCON_T3GSS0_MASK                                 0x1
#define _T3GCON_T3GSS1_POSN                                 0x1
#define _T3GCON_T3GSS1_POSITION                             0x1
#define _T3GCON_T3GSS1_SIZE                                 0x1
#define _T3GCON_T3GSS1_LENGTH                               0x1
#define _T3GCON_T3GSS1_MASK                                 0x2
#define _T3GCON_T3GVAL_POSN                                 0x2
#define _T3GCON_T3GVAL_POSITION                             0x2
#define _T3GCON_T3GVAL_SIZE                                 0x1
#define _T3GCON_T3GVAL_LENGTH                               0x1
#define _T3GCON_T3GVAL_MASK                                 0x4
#define _T3GCON_T3GGO_T3DONE_POSN                           0x3
#define _T3GCON_T3GGO_T3DONE_POSITION                       0x3
#define _T3GCON_T3GGO_T3DONE_SIZE                           0x1
#define _T3GCON_T3GGO_T3DONE_LENGTH                         0x1
#define _T3GCON_T3GGO_T3DONE_MASK                           0x8
#define _T3GCON_T3GSPM_POSN                                 0x4
#define _T3GCON_T3GSPM_POSITION                             0x4
#define _T3GCON_T3GSPM_SIZE                                 0x1
#define _T3GCON_T3GSPM_LENGTH                               0x1
#define _T3GCON_T3GSPM_MASK                                 0x10
#define _T3GCON_T3GTM_POSN                                  0x5
#define _T3GCON_T3GTM_POSITION                              0x5
#define _T3GCON_T3GTM_SIZE                                  0x1
#define _T3GCON_T3GTM_LENGTH                                0x1
#define _T3GCON_T3GTM_MASK                                  0x20
#define _T3GCON_T3GPOL_POSN                                 0x6
#define _T3GCON_T3GPOL_POSITION                             0x6
#define _T3GCON_T3GPOL_SIZE                                 0x1
#define _T3GCON_T3GPOL_LENGTH                               0x1
#define _T3GCON_T3GPOL_MASK                                 0x40
#define _T3GCON_TMR3GE_POSN                                 0x7
#define _T3GCON_TMR3GE_POSITION                             0x7
#define _T3GCON_TMR3GE_SIZE                                 0x1
#define _T3GCON_TMR3GE_LENGTH                               0x1
#define _T3GCON_TMR3GE_MASK                                 0x80
#define _T3GCON_T3GGO_POSN                                  0x3
#define _T3GCON_T3GGO_POSITION                              0x3
#define _T3GCON_T3GGO_SIZE                                  0x1
#define _T3GCON_T3GGO_LENGTH                                0x1
#define _T3GCON_T3GGO_MASK                                  0x8
#define _T3GCON_T3DONE_POSN                                 0x3
#define _T3GCON_T3DONE_POSITION                             0x3
#define _T3GCON_T3DONE_SIZE                                 0x1
#define _T3GCON_T3DONE_LENGTH                               0x1
#define _T3GCON_T3DONE_MASK                                 0x8

// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0xF98);
#ifndef _LIB_BUILD
asm("PIR5 equ 0F98h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIF                :1;
        unsigned TMR5GIF                :1;
        unsigned TMR5IF                 :1;
        unsigned TMR6IF                 :1;
        unsigned TMR8IF                 :1;
        unsigned CM3IF                  :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0xF98);
// bitfield macros
#define _PIR5_TMR1GIF_POSN                                  0x0
#define _PIR5_TMR1GIF_POSITION                              0x0
#define _PIR5_TMR1GIF_SIZE                                  0x1
#define _PIR5_TMR1GIF_LENGTH                                0x1
#define _PIR5_TMR1GIF_MASK                                  0x1
#define _PIR5_TMR5GIF_POSN                                  0x1
#define _PIR5_TMR5GIF_POSITION                              0x1
#define _PIR5_TMR5GIF_SIZE                                  0x1
#define _PIR5_TMR5GIF_LENGTH                                0x1
#define _PIR5_TMR5GIF_MASK                                  0x2
#define _PIR5_TMR5IF_POSN                                   0x2
#define _PIR5_TMR5IF_POSITION                               0x2
#define _PIR5_TMR5IF_SIZE                                   0x1
#define _PIR5_TMR5IF_LENGTH                                 0x1
#define _PIR5_TMR5IF_MASK                                   0x4
#define _PIR5_TMR6IF_POSN                                   0x3
#define _PIR5_TMR6IF_POSITION                               0x3
#define _PIR5_TMR6IF_SIZE                                   0x1
#define _PIR5_TMR6IF_LENGTH                                 0x1
#define _PIR5_TMR6IF_MASK                                   0x8
#define _PIR5_TMR8IF_POSN                                   0x4
#define _PIR5_TMR8IF_POSITION                               0x4
#define _PIR5_TMR8IF_SIZE                                   0x1
#define _PIR5_TMR8IF_LENGTH                                 0x1
#define _PIR5_TMR8IF_MASK                                   0x10
#define _PIR5_CM3IF_POSN                                    0x5
#define _PIR5_CM3IF_POSITION                                0x5
#define _PIR5_CM3IF_SIZE                                    0x1
#define _PIR5_CM3IF_LENGTH                                  0x1
#define _PIR5_CM3IF_MASK                                    0x20

// Register: IPR5
#define IPR5 IPR5
extern volatile unsigned char           IPR5                __at(0xF99);
#ifndef _LIB_BUILD
asm("IPR5 equ 0F99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1GIP                :1;
        unsigned TMR5GIP                :1;
        unsigned TMR5IP                 :1;
        unsigned TMR6IP                 :1;
        unsigned TMR8IP                 :1;
        unsigned CM3IP                  :1;
    };
    struct {
        unsigned CCH05                  :1;
        unsigned CCH15                  :1;
        unsigned                        :1;
        unsigned EVPOL05                :1;
        unsigned EVPOL15                :1;
    };
} IPR5bits_t;
